Repository: NATKazakhstan/AspWebGen
Catalog: Nat.Web.Controls/Properties/Resources.*.resx
Languages: kk_kz

# EExportMaxCountRecords
source: Экспортировать больше {0} записей запрещено. Используйте фильтр что бы получить меньший список.
kk_kz: Kóp jazbalardy {0} eksporttaýǵa tıym salynǵan. Az tizimdi alý úshin súzgileýdi qoldanyńyz.

# SInvalidFormatInFilter
source: Введенное значение не соответствует формату в поле фильтра "{0}".
kk_kz: Engizilgen mán "{0}" súzgi alańyndaǵy formatqa sáıkes kelmeıdi.

# SInvalidDateFormatInFilter
source: Не верно введена дата в поле фильтра "{0}".
kk_kz: "{0}" súzgi alańyna kún durys engizilmegen.

# SInvalidNumericFormatInFilter
source: Не верно введено число в поле фильтра "{0}".
kk_kz: "{0}" súzgi alańyna san durys engizilmegen.

# SToDay
source: Текущий день
kk_kz: Aǵymdaǵy kún

# SOnKz
source: На казахском
kk_kz: Qazaq tilinde

# SOnRu
source: На русском
kk_kz: Orys tilinde

# SExceptionOccurredTryAgainOrReload
source: Возникла ошибка при выполнении операции, перезагрузить страницу и попробуйте еще раз.
kk_kz: Operatsıiany oryndaýk ezinde qate tabyldy, paraqty qaıta júkteý jáne qaıtalap kórý

# SShowDublicates
source: Вывести
kk_kz: Shyǵarý

# SLengthMore
source: Длина больше
kk_kz: Uzyndyǵy artyq

# SLengthLess
source: Длина меньше
kk_kz: Uzyndyǵy tómen

# SDaysLeftAndMore
source: Осталось от N дней
kk_kz: N kún qaldy

# SDaysAgoAndMore
source: Прошло от N дней
kk_kz: N kún ótti

# SQuickSearch
source: Быстрый поиск
kk_kz: Jyldam izdeý

# SSearch
source: Искать
kk_kz: Izdeý

# SConfirmTitleText
source: Подтверждение
kk_kz: Rastaý

# SSearchLoading
source: Поиск...
kk_kz: Izdeý...

# ERecordModifiedByOther
source: Запись была кем-то изменена
kk_kz: Jazba bireý arqyly ózgertildi

# EDoesNotHavePermitForAdd
source: Нет прав на добавление
kk_kz: Engizý quqyǵy joq

# EDoesNotHavePermitForEdit
source: Нет прав на редактирование
kk_kz: Túzetý engizý quqyǵy joq
