Repository: NATKazakhstan/AspWebGen
Catalog: Nat.Web.Controls/Properties/Resources.*.resx
Languages: kk_kz

# SInvalidBindingInput
source: Введены некорректные данные.
kk_kz: Qate málimet engizilgen

# SSelectText
source: Выбрать
kk_kz: Tańdaý

# SAddRecord
source: Добавить запись
kk_kz: Jazba qosý

# SCancelText
source: Отмена
kk_kz: Boldyrmaý

# SError
source: Ошибка
kk_kz: Qate

# SEditText
source: Редактировать
kk_kz: Ózgertý

# SDeleteText
source: Удалить
kk_kz: Joiý

# SInsertText
source: Вставить
kk_kz: Kiristirý

# SLoading
source: Загрузка...
kk_kz: Engizý...

# SPleaseWait
source: Загрузка...
kk_kz: Engizý...

# SNotSpecified
source: Не указано
kk_kz: Belgilenbegen

# SNewText
source: Новый
kk_kz: Jańa

# SUpdateText
source: Сохранить
kk_kz: Saqtaý

# SConfirmDeleteText
source: Вы действительно хотите удалить?
kk_kz: Siz shynymen joıǵyńyz keledi me?

# SEmptyDataText
source: Нет данных
kk_kz: Derekter joq

# SReport
source: Отчеты
kk_kz: Esepter

# SView
source: Просмотр
kk_kz: Qaraý

# SAdd
source: Добавить
kk_kz: Qosý

# SApplyFilter
source: Применить фильтр
kk_kz: Fıltrdi qoldaný

# SSelectedRowsDelete
source: Удалить выбранные
kk_kz: Tańdalǵan joiý

# SRowIsNotSelected
source: Не выбрана строка
kk_kz: Jol tańdalmaǵan

# SLogErrorMultipleUsers
source: Невозможно сделать запись в журнал сообщений. Нескольким учётным карточкам соответствует одни SID - '{0}'.
kk_kz: Habar jýrnalynda jazba jasaýǵa múmkin emes. Birneshe esep kartochkalarǵa bir SID - '{0}' sáıkes keledi.

# SViewNotAvailable
source: Просмотр невозможен
kk_kz: Qaraý múmkin emes

# SReturnToJournal
source: Вернуться к журналу
kk_kz: Jýrnalǵa oralý

# SYes
source: Да
kk_kz: Iá

# SInformationText
source: Информация
kk_kz: Aqparat

# SNo
source: Нет
kk_kz: Joq

# SViewJournal
source: Перейти к журналу
kk_kz: Jýrnalǵa kóshý

# SShowHistory
source: Показать историю
kk_kz: Tarıhty qaraý

# SSave
source: Сохранить
kk_kz: Saqtaý

# SSelectCondition
source: &lt;Выбрать условие&gt;
kk_kz: &lt;Shartty tańdaý&gt;

# SMore
source: Больше
kk_kz: Kóbirek

# SToJournal
source: В журнал
kk_kz: Jýrnalǵa

# SFieldHasError
source: Выбранное значение в поле '{0}' имеет ошибку:
kk_kz: {0}' alańynda tańdap alynǵan mánde qate bar:

# SInvalidFieldFormat
source: Задан неверный формат поля: {0}
kk_kz: {0} alańynyń durys emes formaty berildi

# SIsFilled
source: Заполнено
kk_kz: Toltyryldy

# SErrorHeaderText
source: Информационное сообщение
kk_kz: Aqparattyq habarlama

# SBetween
source: Между
kk_kz: Arasynda

# SLess
source: Меньше
kk_kz: Az

# SStartsWith
source: Начинается с
kk_kz: bastap bastalady

# ENotCorrectValue
source: Не верно выбрано значение в поле '{0}', которое не может быть сохранено, пожалуйста выберите повторно.
kk_kz: '{0}'alańy durys tańdalǵan joq, ol saqtalyna almaıdy, qaıtadan tańdap alyńyz.

# SIsNotFilled
source: Не заполнено
kk_kz: Toltyrylǵan joq

# SNotEquals
source: Не равно
kk_kz: Teń emes

# SRequiredFieldMessage
source: Необходимо заполнить поле '{0}'
kk_kz: '{0}' alańyn toltyrý qajet.

# SEndsWith
source: Оканчивается на
kk_kz: aiaqtalady

# SCancelAdd
source: Отмена добавления
kk_kz: Qosýdy alyp tastaý

# ENotCorrectDefaultValue
source: Произведено автоматическое заполнение поля '{0}' значением, которое не может быть сохранено.
kk_kz: Saqtalýy múmkin emes mánimen '{0}' alańynyn avtomatty toltyrý júrgizildi.

# SEquals
source: Равно
kk_kz: Teń

# SHideHistory
source: Скрыть историю
kk_kz: Tarıhty jaýyp qoiý

# SContains
source: Содержит
kk_kz: Quramynda bar

# SSaveValidated
source: Сохранить заполненное
kk_kz: Toltyrylǵandy saqtaý

# SInfoNotSaveInvalidated
source: Строки, имеющие ошибки, сохранены не будут
kk_kz: Qatesi bar joldar saqtalmaıdy. Jalǵastyrý qajet pe?

# SQuestionNotSaveInvalidated
source: Строки, имеющие ошибки, сохранены не будут. Продолжить?
kk_kz: Qatesi bar joldar saqtalmaıdy. Jalǵastyrý qajet pe?

# SWordExport
source: Экспорт в MS Word
kk_kz: MS Word-qa eksporttaý

# SJournal
source: Журнал
kk_kz: Jýrnal

# SRangeValidatorErrorMessageInSummary
source: Поле "{2}" может содержать только целые числа от "{0}" до "{1}"
kk_kz: {2}"alańynda tek "{0}" den "{1}"deıingi bútin sandar bolýy kerek

# SRequiredReadOnlyFieldMessage
source: Поле '{0}' должно быть заполнено.
kk_kz: '{0}' jolyn toltyrý qajet.

# SLook
source: Просмотр
kk_kz: Qaraý

# SEdit
source: Редактирование
kk_kz: Túzetý

# SRangeValidatorErrorMessage
source: Содержит только целые числа от "{0}" до "{1}"
kk_kz: "{0}" den "{1}" deıin bútin sandarǵa ıe

# SMoveUpWeight
source: Увеличить вес
kk_kz: Úlkeıtý máni

# SMoveDownWeight
source: Уменьшить вес
kk_kz: Azaıtý máni

# SFilter
source: Фильтр
kk_kz: Fıltr

# SNotExistRow
source: <Сохраненное значение недоступно>
kk_kz: <saqtalǵan mán qoljetimsiz>

# SServiceProcedure_TimeToShutDown
source: В {0} работа с системой будет не возможна.
kk_kz: {0} júıemen jumys múmkin emes.

# EFieldMaxLength
source: В поле '{0}' превышено максимальное количество символов: {0}
kk_kz: Alańda '{0}' sımvoldardyń maksımaldy sany asyp ketken {0}

# SFieldHasErrorWithText
source: Выбранное значение '{1}' в поле '{0}' имеет ошибку:
kk_kz: Alańdaǵy '{0}'tańdap alynǵan máninde '{1}' qate bar:

# EMustBeMoreOrEqualsOfField
source: Должно быть больше или равно полю '{0}'.
kk_kz: {0}" alańynan kóp nemese teń bolý kerek.

# EMustBeMoreOfField
source: Должно быть больше поля '{0}'.
kk_kz: {0}' alańnan kóp bolý kerek.

# SServiceProcedure_TimeBetweenRequest
source: Если в течении времени ({0}) нет обращений, то считается, что завершена работа на странице.
kk_kz: eger ({0}) ýaqyt aralyǵynda ótinish bolmasa, paraqtaǵy jumys aiaqtaldy dep sanalady.

# SChangeHieght
source: Изменить высоту поля
kk_kz: Alań bıiktigin ózgertý

# SMaxLengthOfField
source: Максимальная длина поля '{0}' {1} символов
kk_kz: {0}' alańynyń maksımaldy uzaqtyǵy {1} sımvol

# EMaxLength
source: Максимальное количество символов: {0}
kk_kz: Sımvoldardyń maksımaldy sany: {0}

# SServiceProcedure_EnabledMessage
source: Технические работы, просим завершить текущие действия и выйти из системы. Обращение на новые страницы запрещено.
kk_kz: Tehnıkalyq jumystar bastaldy, aǵymdyq jumystardy aiaqtaýdy jáne júıeden shyǵýdy ótinemiz. Jańa paraqtarǵa ótinish bildirýge tyıym salynady.

# SNotCorrectNumber
source: Не верно введено число
kk_kz: San durys engizilmegen

# SNotCorrectNumberOfField
source: Не верно введено число поле '{0}'
kk_kz: {0}' alańynda san durys engizilmegen.

# ENotCorrectValueWithText
source: Не верно выбрано значение '{1}' в поле '{0}', которое не может быть сохранено, пожалуйста выберите повторно.
kk_kz: {0}' alańda '{1}' máni durys tańdap alynbaǵan, saqtalýy múmkin emes, qaıtadan tańdańyz

# ENoPermitToDeleteRecord
source: Нет прав на удаление записи
kk_kz: Jazbany joiýǵa quqyq joq.

# SClearFilter
source: Очистить фильтр
kk_kz: Súzgini tazalaý

# EFieldMustBeMoreOrEqualsOfField
source: Поле '{0}' должно быть больше или равно полю '{1}'.
kk_kz: {0}' alańy artyq nemese alańǵa teń bolý kerek '{1}'.

# EFieldMustBeMoreOfField
source: Поле '{0}' должно быть больше поля '{1}'.
kk_kz: {0}' alańy alańnan artyq bolýy '{1}'.

# SMaxLength
source: Превышена допустимая длина {0} символов
kk_kz: {0} sımvoldardyń múmkin uzyndyǵynan asyp ketken.

# SServiceProcedure_TimeOfEndService
source: Предполагаемое время завершения технических работ {0}.
kk_kz: {0} tehnıkalyq jumystardy boljamdy aiaqtaý ýaqyty.

# SServiceProcedure
source: Проводятся технические работы.
kk_kz: Tehnıkalyq jumystar júrgiziledi.

# ENotCorrectDefaultValueWithText
source: Произведено автоматическое заполнение поля '{0}' значением '{1}', которое не может быть сохранено.
kk_kz: Saqtalýy múmkin emes '{1}' mánimen {0}'alańdy avtomatty túrde toltyrý júrgizildi.

# SServiceProcedure_TimeToEnableMessage
source: С {0} планируется проводить технические работы.
kk_kz: {0}-dan bastap tehnıkalyq jumystar júrgizý josparlanady

# SContainsWords
source: Содержит слова
kk_kz: Sózderden turady

# SCountPages
source: Страницы: ({0})
kk_kz: Paraqtary: ({0})

# SCountData
source: Строк: {0}
kk_kz: Joldary: {0}

# SServiceProcedure_Disabled
source: Технические работы в текущий момент не проводятся.
kk_kz: Qazirgi sátte tehnıkalyq jumystar júrgizilmeıdi.

# SChangeHieghtMore
source: Увеличить высоту поля
kk_kz: Alań bıiktigin ulǵaıtý

# SChangeHieghtLess
source: Уменьшить высоту поля
kk_kz: Alań bıiktigin tómendetý

# SClose
source: Закрыть
kk_kz: Jabý

# SSCCancelViewSettings
source: Отмена
kk_kz: Boldyrmaý

# SSavingJournal_Cancel
source: Отменить
kk_kz: Boldyrmaý

# SSCApplyFixedHeader
source: Применить
kk_kz: Paıdalaný

# SSCApplyViewSettings
source: Применить
kk_kz: Paıdalaný

# SDownLoad
source: Скачать
kk_kz: Kóshirip alý

# SSavingJournal_Save
source: Сохранить
kk_kz: Saqtaý

# SHelp
source: Справка
kk_kz: Anyqtama

# STotal
source: Итого
kk_kz: Barlyǵy

# SInputFormat
source: Введите необходимый формат
kk_kz: Qajetti formatty engizińiz

# SViewSettings_VerticalHeader
source: Вертикальный заголовок
kk_kz: Tik taqyryp

# SViewSettings_Visible
source: Видимость колонки в журнале
kk_kz: Jýrnaldaǵy baǵananyń kórinýi

# SInputFormatList
source: Выберите необходимый формат
kk_kz: Qajetti formatty tańdańyz

# SMultipleSelect
source: Выбор записей
kk_kz: Jazbalardy tańdaý

# SSelect
source: Выбор записи
kk_kz: Jazbany tańdaý

# SHeight
source: Высота
kk_kz: Bıiktigi

# SGroupOfJournal
source: Группировка в журнале
kk_kz: Jýrnaldaǵy toptasý

# SAddGroupColumn
source: Добавить группировку
kk_kz: Toptasýdy qosý

# SAddGroupColumnTop
source: Добавить группировку
kk_kz: Toptasýdy qosý

# SAddFilter
source: Добавить фильтр
kk_kz: Súzgini qosý

# EMustBeLessOrEqualsOfField
source: Должно быть меньше или равно полю '{0}'.
kk_kz: {0}' torynan kem nemese oǵan teń bolý kerek.

# EMustBeLessOfField
source: Должно быть меньше поля '{0}'.
kk_kz: {0}' torynan kem bolý kerek.

# SNotSelectRecordOrNotExists
source: Запись не выбрана или отсутствует.
kk_kz: Jazý tandap alynǵan joq nemese joq

# SSCFixedHeader
source: Зафиксировать заголовок
kk_kz: Taqyrypty bekitý

# SCountChanges
source: изменений {0}
kk_kz: Ózgertýler {0}

# SChangedData
source: Изменения данных
kk_kz: Málimetterdiń ózgerýi

# SSCColsCountFixed
source: Количество зафиксированных колонок
kk_kz: Bekitilgen baǵanalar sany

# SSCRowsCountFixed
source: Количество зафиксированных строк
kk_kz: Bekitilgen joldar sany

# SMaxRecursionInHeader
source: Максимальная вложенность в заголовке
kk_kz: Taqyrybyna barynsha salý

# SNavigationMenu
source: Меню навигации
kk_kz: Navıgatsıialar mazmuny

# SViewSettings
source: Настройка представления
kk_kz: Kórinisti kúıge keltirý

# SNotCorrectNumberForWeight
source: Не верно введено число.
kk_kz: San qate engizildi.

# SDownGroup
source: Опустить группу ниже
kk_kz: Topty tómen túsirý

# ENotExistsRowOrName
source: Отсутствует запись или наименование записи
kk_kz: Jazba nemese jazbanyń ataýy joq

# SClearText
source: Очистить
kk_kz: Tazartý

# SSCParameters
source: Панель заливки
kk_kz: Quiý jıegi

# SToLeft
source: Переместить влево
kk_kz: Solǵa oryn aýystyrý

# SToRight
source: Переместить вправо
kk_kz: Oiǵa oryn aýystyrý

# PressToOpenCloseGroup
source: По нажатию разворачивается/сворачивается группа
kk_kz: Basý arqyly top ashylady/jabylady

# SUpGroup
source: Поднять группу выше
kk_kz: Topty joǵary kóterý

# SSubscription
source: Подписка
kk_kz: Jazylý

# SAllHierarchy
source: Показать верхний уровень заголовка
kk_kz: Taqyryptyń joǵarǵy deńgeıin kórsetý

# SShowAllFilters
source: Показать весь список фильтров
kk_kz: Súzgilerdiń barlyq tizimin kórsetý

# SShowMainGroupFilters
source: Показывать только основной список фильтров
kk_kz: Súzgilerdiń tek negizgi tizimin ǵana kórsetý

# EFieldMustBeLessOrEqualsOfField
source: Поле '{0}' должно быть меньше или равно полю '{1}'.
kk_kz: {0}' tory '{1}' torynan kem nemese oǵan teń bolý kerek.

# EFieldMustBeLessOfField
source: Поле '{0}' должно быть меньше поля '{1}'.
kk_kz: {0}' tory '{1}' torynan kem bolý kerek.

# SSavingJournal_Load
source: Применить настройки
kk_kz: Kúıge keltirýdi qoldaný

# SLoadViewSettings
source: Применить сохраненные настройки
kk_kz: Saqtalǵan kúıge keltirýdi qoldaný

# SEditLook
source: Просмотр/Редактирование
kk_kz: Qaraý/Túzetý

# PressToOpenGroup
source: Развернуть группу
kk_kz: Topty ashý

# SWithCorner
source: с уголком
kk_kz: buryshpen

# PressToCloseGroup
source: Свернуть группу
kk_kz: Topty jabý

# Scm
source: см.
kk_kz: qara.

# SSaveWithoutHistory
source: Сохранить запись без истории
kk_kz: Jazbany tarıhsyz saqtaý

# SSaveAndAddRecord
source: Сохранить и добавить запись
kk_kz: Saqtaý jáne jazba qosý

# SSaveViewSettings
source: Сохранить настройки представления
kk_kz: Kórinistiń retteýlerin saqtaý

# SStartHeaderFromLevel
source: Строить заголовок начиная с
kk_kz: bastap taqyrybyn jasaý

# SRemoveAllGroups
source: Убрать все группировки
kk_kz: Barlyq toptasýdy alyp tastaý

# SRemoveGroupColumn
source: Убрать группировку
kk_kz: Toptasýdy alyp tastaý

# SRemoveFilter
source: Удалить фильтр
kk_kz: Súzgini joiý

# SFilterHeader
source: Фильтровать заголовок
kk_kz: Taqyrybyn súzgiden ótkizý

# SDataFilters
source: Фильтры данных
kk_kz: Málimetter súzgisi

# SHeaderFilters
source: Фильтры заголовка
kk_kz: Taqyryp súzgileri

# SWidth
source: Ширина
kk_kz: Eni

# SExport
source: Экспорт
kk_kz: Eksport

# SCCCApplyConcatenateColumns
source: Применить
kk_kz: Paıdalaný

# SCCCCancelConcatenateColumns
source: Отмена
kk_kz: Boldyrmaý

# SCCCDeleteConcatenateColumns
source: Удалить
kk_kz: Joiý

# SConcatenateColumns
source: Объединить колонки
kk_kz: Baǵanalardy biriktirý

# SCCConcatenatedColumnsTitle
source: Список объединенных колонок
kk_kz: Biriktirilgen baǵanalar tizimi

# SCCLeftColumnListTitle
source: Доступные для объединения колонки
kk_kz: Biriktirýge jetimdi baǵanalar

# SCCRightColumnListTitle
source: Объединяемые колонки
kk_kz: Biriktiriletin baǵanalar

# SCCFromLeftToRight
source: Добавить для объединения
kk_kz: Biriktirý úshin qosý

# SCCFromRightToLeft
source: Удалить из объединения
kk_kz: Birlestikten joiý

# SAggregateCount
source: Количество
kk_kz: Sany

# SAggregateMax
source: Максимальное
kk_kz: Maksımaldi

# SAggregateMin
source: Минимальное
kk_kz: Eń az

# SFilterByPeriod
source: На дату
kk_kz: Kúni

# SNameKz
source: Наименование (КАЗ)
kk_kz: Ataýy (qaz)

# SNameRu
source: Наименование (РУС)
kk_kz: Ataýy (ORYS)

# SAggregateSum
source: Сумма
kk_kz: Soma

# SAggregateNone
source: Без итога
kk_kz: Jalpy sansyz

# SAggregateGroupTextToolTip
source: Выводится текст группы
kk_kz: Toptyń mátini shyǵady

# SAddGroupColumnLeft
source: Группировать объединяя ячейки строк
kk_kz: joldardyń uiashyqtaryn biriktire otyryp, toptastyrý

# SAddGroupColumnLeftTotal
source: Группировать объединяя ячейки строк с итогом
kk_kz: Jalpylanǵan joldardyń uiashyqtaryn biriktire otyryp, toptastyrý

# SGroupColumnNotSet
source: Группировка не указана
kk_kz: Toptastyrma kórsetilmegen

# SAddGroupColumnTopTotal
source: Добавить группировку с итогом
kk_kz: Jalpylanǵan toptastyrmany qosý

# SAddGroupColumnTotal
source: Добавить итог
kk_kz: Jalpy sanyn qosý

# SLoadFilters
source: Загрузить фильтры (если сохранены)
kk_kz: Súzgishterdi júkteý (eger saqtalsa)

# SColumnColorFill
source: Залить колонки цветом
kk_kz: Baǵanalardy túspen boiaý

# SRowColorFill
source: Залить строки цветом
kk_kz: joldardy túspen boiaý

# SCellColorFill
source: Залить ячейки цветом
kk_kz: Uiashyqtardy túspen boiaý

# STotalFor
source: Итого за {0}
kk_kz: {0}-ǵa jalpy sany

# SViewSettingsFixedHeader
source: Настройки закрепления заголовка и колонок
kk_kz: Ataýyn jáne baǵanany bekitý dáldeýleri

# SAddedGroupColumnLeft
source: Объединяются ячейки группы строк
kk_kz: Joldar tobynyń uiashyqtaryn biriktirý

# SOrderByColumnRemove
source: Отменить сортировку
kk_kz: Sorttaýdy toqtatý

# SColorPalette
source: Палитра
kk_kz: Palıtra

# SRewriteSettings
source: Перезаписать настройки:
kk_kz: Dáldeýlerdi qaıta jazý

# SToReportPlugin
source: Перейти в менеджер отчетов
kk_kz: Esepter menedjerine kóshý

# SShowForAll
source: Показывать всем
kk_kz: Barlyǵyna kórsetý

# SCancelColorFill
source: Прекратить действие заливки
kk_kz: Quiý áreketterin toqtatý

# SCancelFontColorFill
source: Прекратить действие указание цвета
kk_kz: Tústi kórsetý áreketterin toqtatý

# SLoadViewSettingsHeader
source: Применение сохраненных настроек
kk_kz: Saqtalǵan dáldeýlerdi qoldaný

# SWithCornerUpper
source: С уголком
kk_kz: Buryshymen

# SSessionIsLost
source: Сессия устарела. Необходимо страницу открыть заново.
kk_kz: Sessıiasy eskirgen. Betti qaıta ashý qajet.

# SOrderByColumn
source: Сортировать
kk_kz: Suryptaý

# SOrderByColumnDesc
source: Сортировать в обратном порядке
kk_kz: Keri retpen suryptaý

# SSaveViewSettingsHeader
source: Сохранение настроек представления
kk_kz: Usynystardyń dáldeýlerin saqtaý

# SLoadViewSettings_SavedSettings
source: Сохраненные настройки
kk_kz: Saqtalǵan dáldeýler

# SSaveFilters
source: Сохранить фильтры
kk_kz: Súzgini saqtaý

# SAggregateAvg
source: Среднее
kk_kz: Orta sany

# SAggregateGroupText
source: Текст группы
kk_kz: Toptyń mátini

# SAggregateTextGroup
source: Текст группы итога
kk_kz: Jalpylanǵan toptyń mátini

# SCurrentColor
source: Текущий цвет
kk_kz: Qazirgi túsi

# SAddedGroupColumnTotal
source: Указан итог
kk_kz: Barlyǵy kórsetilgen

# SAddedGroupColumnTop
source: Указана группировка
kk_kz: Toptastyrma kórsetilgen

# SAddedGroupColumnTopTotal
source: Указана группировка с итогами
kk_kz: Jalpylanǵan toptastyrma kórsetilgen

# SColumnFontColorFill
source: Указать цвет текста колонки
kk_kz: Baǵana mátininiń túsin kórsetý

# SRowFontColorFill
source: Указать цвет текста строки
kk_kz: Jol mátininiń túsin kórsetý

# SCellFontColorFill
source: Указать цвет текста ячейки
kk_kz: Uiashyq mátininiń túsin kórsetý

# SAggregateNumericGroup
source: Числа
kk_kz: Sandar

# SFilterInSqlTimeOutException
source: Необходимо изменить фильтр, т.к. за отведенное время не удалось выбрать необходимые данные. Не рекомендуется использовать критерии "Содержит", "Содержит слова", "Оканчивается на". Рекомендуется использовать критерий "Равно" или "Не равно".
kk_kz: Berilgen ýaqyt ishinde qajetti málimetterdi taba almaǵandyqtan súzgishti ózgertý qajet. EQuramynda", EQuramyndaǵy sózi bar", "Kelesige aiaqtalady" krıterıılerin qoldaný usynylmaıdy. "Teń" nemese "Teń emes" krıterıılerin qoldaný usynylady.

# SRequiredFilters
source: Требуется указать обязательные фильтры. Для этого необходимо зайти в фильтры и заполнить те, у которых есть символ "*" в названии
kk_kz: Mindetti súzgilerdi kórsetý qajet. Bul úshin súzgilerge kirip, ataýynda "*" nyshany baryn toltyrý kerek

# EUserDoesNotHaveExportPermitions
source: Нет прав на экспорт журнала "{0}"
kk_kz: "{0}" jýrnlyn eksporttaýǵa quqyǵy joq

# EUserDoesNotHaveViewPermitions
source: Нет прав на просмотр журнала "{0}"
kk_kz: "{0}" Jýrnaldy qaraýǵa quqyǵy joq

# SAggregateGroupTextWithTotalPhrase
source: Итого за "группа"
kk_kz: "Tobynyń" jalpy sany

# SAggregateGroupTextWithTotalPhraseToolTip
source: Выводится фраза "Итого за " и текст группы
kk_kz: "Qorytyndy" frazasy jáne top mátini shyǵady

# SAddedGroupColumnLeftTotal
source: Объединяются ячейки группы строк с итогами
kk_kz: Jalpylanǵan joldar tobynyń uiashyqtary biriktiriledi

# SRowArchive
source: Значение не актуально (в архиве)
kk_kz: Máni ózekti emes (muraǵatta)

# SRefresh
source: Обновить
kk_kz: Jańartý

# SPostFileTextFromClipboard
source: Загрузить текстовый файл из буфера обмена (текст из буфера обмена загружается файлом)
kk_kz: Almasý býferinen mátindik faılyn júkteý (almasý býferinen mátinin faılmen júkteledi)

# SPostFileFromDialog
source: Загрузить файл
kk_kz: Faıldy júkteý

# SPostFileImageFromClipboard
source: Загрузить файл картинку из буфера обмена (картинка из буфера обмена загружается JPEG файлом)
kk_kz: Almasý býferinen sýretin faıldy júkteý (almasý býferinen sýretin JPEG faılmen júkteledi)

# SFileName
source: Название файла
kk_kz: Faıldyń ataýy

# SEndCrossDataEdit
source: Необходимо обновить страницу.
kk_kz: Betti jańartýǵa kerek.

# SServiceProcedure_BeforeEnabledMessage
source: С {0} планируется проводить {1}.
kk_kz: {0}-dan bastap {1} júrgizý josparlanady

# SServiceProcedure_CauseMessage
source: {0}, просим завершить текущие действия и выйти из системы. Обращение на новые страницы запрещено.
kk_kz: {0}, aǵymdyq jumystardy aiaqtaýdy jáne júıeden shyǵýdy ótinemiz. Jańa paraqtarǵa ótinish bildirýge tyıym salynady.

# SServiceProcedure_TimeOfEndCause
source: Предполагаемое время завершения {0}.
kk_kz: {0} boljamdy aiaqtaý ýaqyty.

# SMultipleSelectedMessage
source: Выбрано записей: {0}
kk_kz: Jazbalar tańdap alyndy: {0}

# SAddingText
source: Добавление
kk_kz: Qosý

# SAccessDanied
source: Доступ запрещен
kk_kz: Kirý ruqsat etilmegen

# SInfoMessageTitle
source: Информация
kk_kz: Aqparat

# SContainsAnyWord
source: Любой из
kk_kz: Usynylatyndardyń kez kelgeni

# ECanNotDeleteUseInSystem
source: Невозможно удалить запись, используется в системе
kk_kz: Jazbany óshirý múmkin emes, júıede paıdalanylady

# SErrorMessageTitle
source: Ошибка
kk_kz: Qate

# SDateBetween
source: Период
kk_kz: Kezeń

# SScriptExportMaxCountRecords
source: alert("Экспортировать больше {0} записей запрещено. Используйте фильтр что бы получить меньший список."); return false;
kk_kz: alert("Kóp jazbalardy eksporttaýǵa {0} tıym salynǵan. Az tizimdi alý úshin súzgileýdi qoldanyńyz."); return false;

# SScriptExportAttentionCountRecords
source: if(confirm("В журнале {1} записей. Экспорт потребует некоторого времени. Возможно стоит пересмотреть фильтр что бы получить меньший список.")) return true; return false;
kk_kz: if(confirm("Jazbalar {1} jýrnalynda. Eksporttaý shamaly ýaqytty qajet etedi. Az tizimdi alý úshin súzgileýdi qaraý kerek shyǵar.")) return true; return false;

# SWizardPrevious
source: Вернуться назад
kk_kz: Keri qaıtý

# SSelectAllFromAllPages
source: Выбрать все записи со всех страниц
kk_kz: Barlyq paraqtardan jazbalardy tańdaý

# SAddGroupColumnInHeader
source: Добавить группировку в заголовок
kk_kz: Taqyrypqa toptaýdy engizý

# ERowIsDeletedOrNotHavePermissions
source: Запись удалена или недостаточно прав
kk_kz: Jazba joıyldy nemese qajetti mólsherde durys emes

# SNotContains
source: Не содержит
kk_kz: Quramynda joq

# SChildDataContainsFalseText
source: Не содержит данные
kk_kz: Derekter joq

# SNotContainsWords
source: Не содержит слова
kk_kz: Quramynda sóz joq

# ECanNotEditRecord
source: Нельзя редактировать запись
kk_kz: Jazbaǵa túzetý engizýge bolmaıdy

# SNoOneSelectedRow
source: Ни одна запись не выбрана
kk_kz: Eshqandaı jazba tańdalyp alynǵan joq

# SNoOneSelectedRowCheckRecords
source: Ни одна запись не выбрана. Проставьте галочки.
kk_kz: Eshqandaı jazba tańdalyp alynǵan joq. Qanat belgisin qoıyńyz.

# SMoveDownRecord
source: Опустить запись ниже
kk_kz: Jazbany tómen túsirý

# SMoveDownRecordOn
source: Опустить запись ниже на (количество строк):
kk_kz: Jazbany -qa tómen túsirý (joldar sany)

# SWizardNext
source: Перейти далее
kk_kz: Ári ótý

# SMoveUpRecord
source: Поднять запись выше
kk_kz: Jazbany joǵary kóterý

# SMoveUpRecordOn
source: Поднять запись выше на (количество строк):
kk_kz: Jazbany -qa joǵary kóterý (joldar sany):

# SDateMore
source: Позже
kk_kz: Keıinirek

# SDateLess
source: Раньше
kk_kz: Erterek

# SUnselectAllFromAllPages
source: Снять выбор со всех страниц
kk_kz: Barlyq paraqtardan Irikteýdi salyp tastaý

# SChildDataContainsTrueText
source: Содержит данные
kk_kz: Derekter bar

# SSaveAddToolTip
source: Сохранить запись и открыть добавление новой записи
kk_kz: Jazbalardy saqtaý jáne jańa jazbany ashýdy qosý

# SSaveToolTip
source: Сохранить запись и перейти в журнал
kk_kz: Jazbalardy saqtap, jýrnalǵa aýysý

# SAddedGroupColumnInHeader
source: Указана группировка для заголовка
kk_kz: Taqyrypqa arnalǵan toptastyrý kórsetilgen
