Repository: NATKazakhstan/AspWebGen
Catalog: AjaxControlToolkit/ScriptResources/ScriptResources.*-*.resx
Languages: chs, kk_kz

# AlwaysVisible_ElementRequired
source: AjaxControlToolkit.AlwaysVisibleControlBehavior must have an element
chs: 必须为 AjaxControlToolkit.AlwaysVisibleControlBehavior 指定一个元素
kk_kz: AjaxControlToolkit.AlwaysVisibleControlBehavior: element kórsetilýi kerek

# Animation_CannotNestSequence
source: AjaxControlToolkit.Animation.SequenceAnimation cannot be nested inside AjaxControlToolkit.Animation.ParallelAnimation
chs: AjaxControlToolkit.Animation.ParallelAnimation 不能内含 AjaxControlToolkit.Animation.SequenceAnimation
kk_kz: AjaxControlToolkit.Animation.SequenceAnimation AjaxControlToolkit.Animation.ParallelAnimation engizilýi múmkin emes

# Animation_ChildrenNotAllowed
source: AjaxControlToolkit.Animation.createAnimation cannot add child animations to type "{0}" that does not derive from AjaxControlToolkit.Animation.ParentAnimation
chs: AjaxControlToolkit.Animation.createAnimation 无法加入一个不是派生自 AjaxControlToolkit.Animation.ParentAnimation 且类型为 {0} 的子动画
kk_kz: AjaxControlToolkit.Animation.createAnimation не может добавить дочернюю анимацию к типу "{0}", который не является производным от AjaxControlToolkit.Animation.ParentAnimation

# Animation_InvalidBaseType
source: AjaxControlToolkit.Animation.registerAnimation can only register types that inherit from AjaxControlToolkit.Animation.Animation
chs: AjaxControlToolkit.Animation.registerAnimation 只能注册那些继承自 AjaxControlToolkit.Animation.Animation 的类型
kk_kz: AjaxControlToolkit.Animation.registerAnimation tek AjaxControlToolkit.Animation.Animation qalatyn túrlerdi ǵana tirkeýi múmkin

# Animation_InvalidColor
source: Color must be a 7-character hex representation (e.g. #246ACF), not "{0}"
chs: 标记名称 Color 必须是 7 个字符的 16 进位字符串（例如：#246ACF），不能是 {0}
kk_kz: Tús 7-ti belgili on alty eselik kórsetýde bolý kerek (iaǵnı #246ACF), biraq "{0}" emes)

# Animation_MissingAnimationName
source: AjaxControlToolkit.Animation.createAnimation requires an object with an AnimationName property
chs: AjaxControlToolkit.Animation.createAnimation 必须持有一个 AnimationName 属性的对象
kk_kz: AjaxControlToolkit.Animation.createAnimation AnimationName qasıeti bar obektini qajet etedi

# Animation_NoDynamicPropertyFound
source: AjaxControlToolkit.Animation.createAnimation found no property corresponding to "{0}" or "{1}"
chs: AjaxControlToolkit.Animation.createAnimation 找不到相对应的 {0} 或 {1} 属性
kk_kz: AjaxControlToolkit.Animation.createAnimation не нашел свойство, относящееся к "{0}" или "{1}"

# Animation_NoPropertyFound
source: AjaxControlToolkit.Animation.createAnimation found no property corresponding to "{0}"
chs: AjaxControlToolkit.Animation.createAnimation 找不到相对应的 {0} 属性
kk_kz: AjaxControlToolkit.Animation.createAnimation не нашел свойство, относящееся к "{0}"

# Animation_TargetNotFound
source: AjaxControlToolkit.Animation.Animation.set_animationTarget requires the ID of a Sys.UI.DomElement or Sys.UI.Control. No element or control could be found corresponding to "{0}"
chs: AjaxControlToolkit.Animation.Animation.set_animationTarget 需要一个 Sys.UI.DomElement 或 Sys.UI.Control 类的控件 ID。找不到相对应的 {0} 之元素或控件
kk_kz: AjaxControlToolkit.Animation.Animation.set_animationTarget требует ID типа Sys.UI.DomElement or Sys.UI.Control. Невозможно найти элемент или контрол, соответствующий "{0}"

# Animation_UknownAnimationName
source: AjaxControlToolkit.Animation.createAnimation could not find an Animation corresponding to the name "{0}"
chs: AjaxControlToolkit.Animation.createAnimation 找不到名称为 {0} 的动画
kk_kz: AjaxControlToolkit.Animation.createAnimation невозможно найти Animation, относящуюся к имени "{0}"

# CascadingDropDown_MethodError
source: [Method error {0}]
chs: [方法错误 {0}]
kk_kz: [Ádis qateligi {0}]

# CascadingDropDown_MethodTimeout
source: [Method timeout]
chs: [方法逾时]
kk_kz: [Ádiste kútý ýaqyty asyrylǵan]

# CascadingDropDown_NoParentElement
source: Failed to find parent element "{0}"
chs: 无法找到父元素 {0}
kk_kz: {0} elementtiń ata-anasyn tabý múmkin emes.

# CollapsiblePanel_NoControlID
source: Failed to find element "{0}"
chs: 无法找到元素 {0}
kk_kz: {0} elementti tabý múmkin emes.

# Common_DateTime_InvalidFormat
source: Invalid format
chs: 格式无效
kk_kz: Qate format

# Common_DateTime_InvalidTimeSpan
source: "{0}" is not a valid TimeSpan format
chs: {0} 的 TimeSpan 格式无效
kk_kz: "{0}" durys TimeSpan format dep tabylmaıdy

# Common_InvalidBorderWidthUnit
source: A unit type of "{0}"' is invalid for parseBorderWidth
chs: 单位类型 {0} 对 parseBorderWidth 而言无效
kk_kz: "{0}"' túri birlik parseBorderWidth úshin durys dep eseptelmeıdi

# Common_InvalidPaddingUnit
source: A unit type of "{0}" is invalid for parsePadding
chs: 单位类型 {0} 对 parsePadding 而言无效
kk_kz: {0} túri birlik parsePadding úshin durys dep eseptelmeıdi

# Common_UnitHasNoDigits
source: No digits
chs: 没有数字
kk_kz: Sandar joq

# DynamicPopulate_WebServiceError
source: Web Service call failed: {0}
chs: 无法调用 Web 服务：{0}
kk_kz: Vebservısti sátsiz shaqyrý: {0}

# DynamicPopulate_WebServiceTimeout
source: Web service call timed out
chs: 调用 Web 服务超时
kk_kz: Vebservısti kútý ýaqyty asyrylǵan

# ExtenderBase_CannotSetClientStateField
source: clientStateField can only be set before initialization
chs: 只能在初始化之前设定 clientStateField
kk_kz: clientStateField tek ınıtsıalızatsıianyń aldynda ornatýǵa bolady

# ExtenderBase_ControlNotRegisteredForCallbacks
source: This Control has not been registered for callbacks
chs: 这个控件尚未注册，无法提供回调
kk_kz: Osy Control keri shaqyrý úshin tirkelmegen

# ExtenderBase_InvalidClientStateType
source: saveClientState must return a value of type String
chs: saveClientState 必须返回 String 类型的值
kk_kz: saveClientState String túriniń maǵynasyn qaıtarý kerek

# ExtenderBase_PageNotRegisteredForCallbacks
source: This Page has not been registered for callbacks
chs: 这个页面尚未注册，无法提供回调
kk_kz: Osy Page keri shaqyrý úshin tirkelmegen

# ListSearch_DefaultPrompt
source: Type to search
chs: 请键入以便搜寻
kk_kz: Izdeý úshin túri

# PasswordStrength_DefaultStrengthDescriptions
source: NonExistent;Very Weak;Weak;Poor;Almost OK;Barely Acceptable;Average;Good;Strong;Excellent;Unbreakable!
chs: 没有;很弱;弱;差;差强人意;尚可;普通;好;很好;非常好;臻于完美！
kk_kz: Joq;Óte nashar;Nashar;Jaısyz;Jaqsy derlik;Shamalas Normaly;Normaly; Jaqsy; Kúshti;Tamasha;Birinshi dárejeli!

# PasswordStrength_GetHelpRequirements
source: Get help on password requirements
chs: 取得密码强度的要求说明
kk_kz: Parolge talap boıynsha kómek alý

# PasswordStrength_InvalidStrengthDescriptions
source: Invalid number of text strength descriptions specified
chs: 所指定的密码强度文字内容个数无效
kk_kz: Paroldi qorǵaý deńgeıleri úshin sıpattamalardyń qate sany belgilengen

# PasswordStrength_InvalidStrengthDescriptionStyles
source: Text Strength description style classes must match the number of text descriptions.
chs: 密码强度文字说明的样式表，必须符合文字内容之个数

# PasswordStrength_InvalidWeightingRatios
source: Strength Weighting ratios must have 4 elements
chs: 密码强度的权重比例必须有 4 种
kk_kz: Paroldi qorǵaý salmaqtyq eseliginiń sany 4 teń bolý kerek

# PasswordStrength_RemainingCharacters
source: {0} more characters
chs: 还需要 {0} 个字符
kk_kz: Taǵy {0} árip(ter)

# PasswordStrength_RemainingMixedCase
source: Mixed case characters
chs: 大小写混合
kk_kz: Ór túrli tizilimderde belgileý(ler) qajet

# PasswordStrength_RemainingNumbers
source: {0} more numbers
chs: 还需要 {0} 个数字
kk_kz: Taǵy{0} sany(dar)

# PasswordStrength_RemainingSymbols
source: {0} symbol characters
chs: 还需要 {0} 个符号
kk_kz: Taǵy {0} belgi(ler/di)

# PasswordStrength_Satisfied
source: Nothing more required
chs: 密码强度已经足够
kk_kz: Bary ok.

# PasswordStrength_StrengthPrompt
source: Strength:
chs: 强度：
kk_kz: Parol:

# PopupControl_NoDefaultProperty
source: No default property supported for control "{0}" of type "{1}"
chs: 类型 {1} 的 控件 {0} 不支持预设属性
kk_kz: control "{0}" úshin "{1}" túriniń úndeýsiz qabileti saqtalmaıdy.

# PopupExtender_NoParentElement
source: Couldn't find parent element "{0}"
chs: 无法找到父元素 {0}
kk_kz: {0} elementtiń ata-anasyn tabý múmkin emes.

# Rating_CallbackError
source: An unhandled exception has occurred:\r\n{0}
chs: 发生未处理的异常状况：\r\n{0}
kk_kz: Óńdelmegen erekshelik paıda boldy:\r\n{0}

# ReorderList_DropWatcherBehavior_CallbackError
source: Reorder failed, see details below.\r\n\r\n{0}
chs: 无法重新排列，请参考下面的说明：\r\n\r\n{0}
kk_kz: Qaıta sorttaý qateligi, qosymsha aqparat tómende.\r\n\r\n{0}

# ReorderList_DropWatcherBehavior_NoChild
source: Could not find child of list with id "{0}"
chs: 无法找到 ID 为 {0} 的子清单
kk_kz: id "{0}" bar paraq balany tabý múmkin emes.

# ResizableControlBehavior_CannotChangeProperty
source: Changes to {0} not supported
chs: 不支持对 {0} 的变更
kk_kz: {0} úshin ózgirister saqtalmaıdy

# ResizableControlBehavior_InvalidHandler
source: {0} handler not a function, function name, or function text
chs: {0} 处理例程不是函数、函数名称、或是函数文字
kk_kz: {0} óńdeýshi fýnktsıia, fýnktsıianyń ataýy nemese fýnktsıianyń mátini bolyp tabylmaıdy

# Shared_BrowserSecurityPreventsPaste
source: Your browser security settings don't permit the automatic execution of paste operations. Please use the keyboard shortcut Ctrl+V instead.
chs: 您的浏览器安全性设定，不允许执行自动粘贴的操作。请改用键盘快捷键 Ctrl + V。
kk_kz: Sizdiń braýzerdiń qaýipsizdik beıimdeý qystyrma operatsıiany avtomattandyrylǵan oryndaýyn ruqsat etpeıdi. Ctrl+V kombınatsıiany paıdalanyńyz.

# Slider_NoSizeProvided
source: Please set valid values for the height and width attributes in the slider's CSS classes
chs: 请在 Slider 的 CSS Class 中，设定高度与宽度属性的有效值
kk_kz: CSS polzýnok deńgeıi úshin enniń jáne bıiktiktin durys maǵynasyn ornatyńyz.

# Tabs_ActiveTabArgumentOutOfRange
source: Argument is not a member of the tabs collection
chs: 参数不是索引标签 (Tab) 集合的成员
kk_kz: Dálel sala bastaý jınaǵynyń múshesi dep tabylmaıdy

# Tabs_OwnerExpected
source: owner must be set before initialize
chs: 于初始化之前，必须设定拥有者
kk_kz: Ieni ınıtsıalızatsıianyń aldynda anyqtaý kerek

# Tabs_PropertySetAfterInitialization
source: {0} cannot be changed after initialization
chs: 于初始化之后，无法变更 {0}
kk_kz: {0} ınıtsıalızatsıiadan soń ózgertýge jatpaıdy

# Tabs_PropertySetBeforeInitialization
source: {0} cannot be changed before initialization
chs: 于初始化之前，无法变更 {0}
kk_kz: {0} ınıtsıalızatsıia aldynda ózgertýge jatpaıdy

# ValidatorCallout_DefaultErrorMessage
source: This control is invalid
chs: 这个控件无效
kk_kz: Osy element vılıdnyı bolyp tabylmaıdy

# Calendar_Today
source: Today: {0}
kk_kz: Búgin: {0}
